artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - flow:
      - post:
          url: "/login"
          json:
            login: "admin"
            password: "admin"
          capture:
            json: "$.token"
            as: "token"
      - post:
          url: "/users"
          json:
            name: "querty"
            login: "querty"
            password: "querty"
          headers:
            Authorization: Bearer {{ token }}
            Content-Type: application/json
          capture:
            - json: "$.id"
              as: "id"
      - get:
          url: "/users"
          headers:
            Authorization: Bearer {{ token }}
            Content-Type: application/json
      - think: 5
      - get:
          url: "/users/{{ id }}"
          headers:
            Authorization: Bearer {{ token }}
            Content-Type: application/json
      - put:
          url: "/users/{{ id }}"
          json:
            name: "querty1"
            login: "querty1"
            password: "querty1"
          headers:
            Authorization: Bearer {{ token }}
            Content-Type: application/json
      - delete:
          url: "/users/{{ id }}"
          headers:
            Authorization: Bearer {{ token }}
            Content-Type: application/json